<!DOCTYPE html>
<html lang="en">

<head>
     <meta charset="UTF-8">
     <meta name="viewport" content="width=device-width, initial-scale=1.0">
     <title>"Основы PHP" (Баляев Д.С.)</title>
</head>

<body>
     <p>Здесь представлены практические работы, выполненные Баляевым Дмитрием Сергеевичем.
     <dl>
          <dt><a href="work1.php">Работа 1 - Версия PHP</a></dt>
          <dd>Вызывается функция phpinfo, которая возвращает информацию об интерпретаторе PHP, установленном в данном HTTP-сервере.</dd>

          <dt><a href="work2.php">Работа 2 - Простые математические функции</a></dt>
          <dd>В данной работе рассмотрим использование простых математических функций, использование переменных и организуем вывод результатов.</dd>

          <dt><a href="work3.php">Работа 3 - Взаимодействия с массивами</a></dt>
          <dd>В данной работе рассмотрим взаимодействие с массивами в PHP.</dd>

          <dt><a href="work4.php">Работа 4 - Условия в PHP</a></dt>
          <dd>В данной работе рассмотрим условия в РHP.</dd>

          <dt><a href="work5.php">Работа 5 - Функции для работы со временем и датой в PHP</a></dt>
          <dd>В данной работе рассмотрим функции для работы со временем и датой в РHP.</dd>

          <dt><a href="work6.php">Работа 6 - Пользовательские функции в РHP</a></dt>
          <dd>В данной работе рассмотрим пользовательские функции в РHP.</dd>

          <dt><a href="work7.php">Работа 7 - Циклы. For. Foreach</a></dt>
          <dd>В данной работе рассмотрим циклы for и foreach в РHP.</dd>

          <dt><a href="\work8\index.php">Работа 8 – Учёт заказов магазина «Автозапчасти»</a></dt>
          <dd>Приём, просмотр и хранение заказов магазина «Автозапчасти».</dd>

          <dt><a href="\work9\index.php">Работа 9 – Учёт информации о студентах</a></dt>
          <dd>В данной работе разработаем программу для учёта информации о студентах.</dd>

          <dt><a href="work10.php">Работа 10 - Нахождение корней квадратного уравнения</a></dt>
          <dd>В данной работе напишем скрипт, который будет находить корни квадратного уравнения в РHP.</dd>

          <dt><a href="work11.php">Работа 11 - Нахождение количества слов и символов в тексте</a></dt>
          <dd>В данной работе напишем скрипт, который по нажатию на кнопку будет выводить количество слов и количество символов в тексте в РHP.</dd>

          <dt><a href="work12.php">Работа 12 - Нахождение дня недели, соответствующего выбранной дате</a></dt>
          <dd>В данной работе напишем скрипт, который по нажатию на кнопку выводит на экран день недели, соответствующий выбранной дате в РHP.</dd>

          <dt><a href="\work13\index.php">Работа 13 - Работа с сессиями в PHP.</a></dt>
          <dd>В данной работе напишем программу, использующая сессии в PHP.</dd>

          <dt><a href="\work14\index.php">Работа 14 – Учёт заказов магазина «Автозапчасти» (база данных).</a></dt>
          <dd>Приём, просмотр и хранение заказов магазина «Автозапчасти» с помощью базы данных.</dd>

          <dt><a href="\work15\index.php">Работа 15 – Учёт информации о студентах (база данных)</a></dt>
          <dd>В данной работе разработаем программу для учёта информации о студентах с помощью базы данных.</dd>

          <dt><a href="work16.php">Работа 16 – Введение в ООП на PHP</a></dt>

          <dt><a href="work17.php">Работа 17 – Реализация класса Tag в ООП на PHP</a></dt>

          <dt><a href="work18.php">Работа 18 – Трейты в ООП на PHP</a></dt>

          <dt><a href="\work19\index.php">Работа 19 – Теория пространств имен в ООП на PHP</a></dt>
     </dl>
</body>

</html>